tutorials/multiphaseReactiveTransport/interReactiveTransferFoam/2DCavity/0_org/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0; 

boundaryField
{
    right
    {
        type            zeroGradient;
    }
    left
    {
        type            fixedValue;
        value           uniform 1;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            constantAlphaContactAngle;
        theta0          60;
        limit           zeroGradient;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
